verilog_defaults -push
verilog_defaults -add -defer
read_verilog /home/joao/AppsUserWork/LiteX/litex-setup/pythondata-cpu-picorv32/pythondata_cpu_picorv32/verilog/picorv32.v
read_verilog /home/joao/Documentos/Embarcatech/TarefaFPGA/Embarcatech-Tarefa-5-FPGA/hardware/litex/build/colorlight_i5/gateware/colorlight_i5.v
verilog_defaults -pop
attrmap -tocase keep -imap keep="true" keep=1 -imap keep="false" keep=0 -remove keep=0

synth_ecp5  -top colorlight_i5
write_json  colorlight_i5.json